In [8]:
# preparation for data
manager <- c(1, 2, 3, 4, 5)
date <- c("10/24/08", "10/28/08", "10/1/08", "10/12/08", "5/1/09")
country <- c("US", "US", "UK", "UK", "UK")
gender <- c("M", "F", "F", "M", "F")
age <- c(32, 45, 25, 39, 99)
q1 <- c(5, 3, 3, 3, 2)
q2 <- c(4, 5, 5, 3, 2)
q3 <- c(5, 2, 5, 4, 1)
q4 <- c(5, 5, 5, NA, 2)
q5 <- c(5, 5, 2, NA, 1)
leadership <- data.frame(manager, date, country, gender, age,q1, q2, q3, q4, q5, stringsAsFactors=FALSE)

In [9]:
# creating new variables

mydata <- data.frame(x1 = c(2,2,6,4),
                    x2 = c(3,4,2,8))

mydata <- transform(mydata, sumx = x1+x2, meanx = (x1+x2)/2)
mydata

  x1 x2 sumx meanx
1 2  3   5   2.5
2 2  4   6   3.0
3 6  2   8   4.0
4 4  8  12   6.0

In [10]:
leadership$age[leadership$age == 99] <- NA

leadership <- within(leadership, {agecat <- NA
                                  agecat[age > 75] <- "Elder"
                                 agecat[age >= 55 & age <= 75] <- "Middle Age"
                                 agecat[age < 55] <- "Young"})
# within() 代码将一行一行执行
leadership

  manager date     country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5   5  5 Young
2 2       10/28/08 US      F      45  3  5  2   5  5 Young
3 3       10/1/08  UK      F      25  3  5  5   5  2 Young
4 4       10/12/08 UK      M      39  3  3  4  NA NA Young
5 5       5/1/09   UK      F      NA  2  2  1   2  1 NA

In [11]:
# renaming variables
names(leadership)

 [1] "manager" "date"    "country" "gender"  "age"     "q1"      "q2"
 [8] "q3"      "q4"      "q5"      "agecat"

In [12]:
names(leadership)[2] <- "TestDate"
leadership

  manager TestDate country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5   5  5 Young
2 2       10/28/08 US      F      45  3  5  2   5  5 Young
3 3       10/1/08  UK      F      25  3  5  5   5  2 Young
4 4       10/12/08 UK      M      39  3  3  4  NA NA Young
5 5       5/1/09   UK      F      NA  2  2  1   2  1 NA

In [13]:
library(plyr)
leadership <- rename(leadership, replace = c(manager = "managerID", TestDate = "testDate"))
leadership

  managerID testDate country gender age q1 q2 q3 q4 q5 agecat
1 1         10/24/08 US      M      32  5  4  5   5  5 Young
2 2         10/28/08 US      F      45  3  5  2   5  5 Young
3 3         10/1/08  UK      F      25  3  5  5   5  2 Young
4 4         10/12/08 UK      M      39  3  3  4  NA NA Young
5 5         5/1/09   UK      F      NA  2  2  1   2  1 NA

In [14]:
# missing values
is.na(leadership[,6:10])

     q1    q2    q3    q4    q5
[1,] FALSE FALSE FALSE FALSE FALSE
[2,] FALSE FALSE FALSE FALSE FALSE
[3,] FALSE FALSE FALSE FALSE FALSE
[4,] FALSE FALSE FALSE  TRUE  TRUE
[5,] FALSE FALSE FALSE FALSE FALSE

In [15]:
x <- c(1,2,3,NA)
z <- sum(x)
z

[1] NA

In [16]:
z <- sum(x, na.rm = TRUE)
z

[1] 6

In [17]:
newdata <- na.omit(leadership) # 去掉数据中存在缺失值的行
newdata

  managerID testDate country gender age q1 q2 q3 q4 q5 agecat
1 1         10/24/08 US      M      32  5  4  5  5  5  Young
2 2         10/28/08 US      F      45  3  5  2  5  5  Young
3 3         10/1/08  UK      F      25  3  5  5  5  2  Young

In [18]:
# date values
myformat <- "%m/%d/%y"
leadership$testDate <- as.Date(leadership$testDate, myformat)
leadership

  managerID testDate   country gender age q1 q2 q3 q4 q5 agecat
1 1         2008-10-24 US      M      32  5  4  5   5  5 Young
2 2         2008-10-28 US      F      45  3  5  2   5  5 Young
3 3         2008-10-01 UK      F      25  3  5  5   5  2 Young
4 4         2008-10-12 UK      M      39  3  3  4  NA NA Young
5 5         2009-05-01 UK      F      NA  2  2  1   2  1 NA

In [19]:
today <- Sys.Date()
format(today, "%Y-%m-%d")
# 日期可以做加减运算

[1] "2021-03-19"

In [20]:
a <- c(2,3,5)
a

[1] 2 3 5

In [21]:
is.numeric(a)

[1] TRUE

In [22]:
is.vector(a)

[1] TRUE

In [23]:
a <- as.character(a)

In [24]:
a

[1] "2" "3" "5"

In [25]:
is.character(a)

[1] TRUE

In [28]:
# sorting data
newdata <- leadership[order(leadership$age),]
newdata

  managerID testDate   country gender age q1 q2 q3 q4 q5 agecat
3 3         2008-10-01 UK      F      25  3  5  5   5  2 Young
1 1         2008-10-24 US      M      32  5  4  5   5  5 Young
4 4         2008-10-12 UK      M      39  3  3  4  NA NA Young
2 2         2008-10-28 US      F      45  3  5  2   5  5 Young
5 5         2009-05-01 UK      F      NA  2  2  1   2  1 NA

In [30]:
newdata <- subset(leadership, age >=35 | age <26 , select = c(q1,q2,q3,q4))
newdata

  q1 q2 q3 q4
2 3  5  2   5
3 3  5  5   5
4 3  3  4  NA

In [32]:
newdata <- subset(leadership, age >=35 | age <26 , select = gender:q4)
newdata

  gender age q1 q2 q3 q4
2 F      45  3  5  2   5
3 F      25  3  5  5   5
4 M      39  3  3  4  NA